
arr = [1, 2, 3]
N = 3
sel = [0] * N  # 결과들이 저장될 리스트
check = [0] * N  # 해당 원소를 이미 사용했는지 안했는지에 대한 체크


def perm(idx):
    # 다 뽑아서 정리했다면,
    if idx == N:
        print(sel)
        return
    else:
        for i in range(N):
            if check[i] == 0:
                sel[idx] = arr[i]  # 값을 써라-
                check[i] = 1  # 사용을 했다는 표시
                perm(idx + 1)
                check[i] = 0  # 다음 반복문을 위한 원상복구


perm(0)

# output
# [1, 2, 3]
# [1, 3, 2]
# [2, 1, 3]
# [2, 3, 1]
# [3, 1, 2]
# [3, 2, 1]


############################################################
# 순열 visited 안쓰면
def perm(idx):
    if idx == N:
        print(sel)
    else:
        for i in range(N):
            # if visited[i] == 0:
            sel[idx] = arr[i]
            # visited[i] = 1
            perm(idx+1)
            # visited[i] = 0
N = 3
arr = [1, 2, 3]
sel = [0] * N
# visited = [0] * N
perm(0)

# output
# [1, 1, 1]
# [1, 1, 2]
# [1, 1, 3]
# [1, 2, 1]
# [1, 2, 2]
# [1, 2, 3]
# [1, 3, 1]
# [1, 3, 2]
# [1, 3, 3]
# [2, 1, 1]
# [2, 1, 2]
# [2, 1, 3]
# [2, 2, 1]
# [2, 2, 2]
# [2, 2, 3]
# [2, 3, 1]
# [2, 3, 2]
# [2, 3, 3]
# [3, 1, 1]
# [3, 1, 2]
# [3, 1, 3]
# [3, 2, 1]
# [3, 2, 2]
# [3, 2, 3]
# [3, 3, 1]
# [3, 3, 2]
# [3, 3, 3]